ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32F3xx/stm32f302xe.h
#define FMC_PCR4_ECCPS_Pos          (17U)                                      
#define FMC_PCR4_ECCPS_Msk          (0x7U << FMC_PCR4_ECCPS_Pos)               /*!< 0x000E0000 */
#define FMC_PCR4_ECCPS              FMC_PCR4_ECCPS_Msk                         /*!<ECCPS[2:0] bits (ECC page size)           */
#define FMC_PCR4_ECCPS_0            (0x1U << FMC_PCR4_ECCPS_Pos)               /*!< 0x00020000 */
#define FMC_PCR4_ECCPS_1            (0x2U << FMC_PCR4_ECCPS_Pos)               /*!< 0x00040000 */
#define FMC_PCR4_ECCPS_2            (0x4U << FMC_PCR4_ECCPS_Pos)               /*!< 0x00080000 */

/*******************  Bit definition for FMC_SRx register  *******************/
#define FMC_SRx_IRS_Pos             (0U)                                       
#define FMC_SRx_IRS_Msk             (0x1U << FMC_SRx_IRS_Pos)                  /*!< 0x00000001 */
#define FMC_SRx_IRS                 FMC_SRx_IRS_Msk                            /*!<Interrupt Rising Edge status                */
#define FMC_SRx_ILS_Pos             (1U)                                       
#define FMC_SRx_ILS_Msk             (0x1U << FMC_SRx_ILS_Pos)                  /*!< 0x00000002 */
#define FMC_SRx_ILS                 FMC_SRx_ILS_Msk                            /*!<Interrupt Level status                      */
#define FMC_SRx_IFS_Pos             (2U)                                       
#define FMC_SRx_IFS_Msk             (0x1U << FMC_SRx_IFS_Pos)                  /*!< 0x00000004 */
#define FMC_SRx_IFS                 FMC_SRx_IFS_Msk                            /*!<Interrupt Falling Edge status               */
#define FMC_SRx_IREN_Pos            (3U)                                       
#define FMC_SRx_IREN_Msk            (0x1U << FMC_SRx_IREN_Pos)                 /*!< 0x00000008 */
#define FMC_SRx_IREN                FMC_SRx_IREN_Msk                           /*!<Interrupt Rising Edge detection Enable bit  */
#define FMC_SRx_ILEN_Pos            (4U)                                       
#define FMC_SRx_ILEN_Msk            (0x1U << FMC_SRx_ILEN_Pos)                 /*!< 0x00000010 */
#define FMC_SRx_ILEN                FMC_SRx_ILEN_Msk                           /*!<Interrupt Level detection Enable bit        */
#define FMC_SRx_IFEN_Pos            (5U)                                       
#define FMC_SRx_IFEN_Msk            (0x1U << FMC_SRx_IFEN_Pos)                 /*!< 0x00000020 */
#define FMC_SRx_IFEN                FMC_SRx_IFEN_Msk                           /*!<Interrupt Falling Edge detection Enable bit */
#define FMC_SRx_FEMPT_Pos           (6U)                                       
#define FMC_SRx_FEMPT_Msk           (0x1U << FMC_SRx_FEMPT_Pos)                /*!< 0x00000040 */
#define FMC_SRx_FEMPT               FMC_SRx_FEMPT_Msk                          /*!<FIFO empty                                  */

/*******************  Bit definition for FMC_SR2 register  *******************/
#define FMC_SR2_IRS_Pos             (0U)                                       
#define FMC_SR2_IRS_Msk             (0x1U << FMC_SR2_IRS_Pos)                  /*!< 0x00000001 */
#define FMC_SR2_IRS                 FMC_SR2_IRS_Msk                            /*!<Interrupt Rising Edge status                */
#define FMC_SR2_ILS_Pos             (1U)                                       
#define FMC_SR2_ILS_Msk             (0x1U << FMC_SR2_ILS_Pos)                  /*!< 0x00000002 */
#define FMC_SR2_ILS                 FMC_SR2_ILS_Msk                            /*!<Interrupt Level status                      */
#define FMC_SR2_IFS_Pos             (2U)                                       
#define FMC_SR2_IFS_Msk             (0x1U << FMC_SR2_IFS_Pos)                  /*!< 0x00000004 */
#define FMC_SR2_IFS                 FMC_SR2_IFS_Msk                            /*!<Interrupt Falling Edge status               */
#define FMC_SR2_IREN_Pos            (3U)                                       
#define FMC_SR2_IREN_Msk            (0x1U << FMC_SR2_IREN_Pos)                 /*!< 0x00000008 */
#define FMC_SR2_IREN                FMC_SR2_IREN_Msk                           /*!<Interrupt Rising Edge detection Enable bit  */
#define FMC_SR2_ILEN_Pos            (4U)                                       
#define FMC_SR2_ILEN_Msk            (0x1U << FMC_SR2_ILEN_Pos)                 /*!< 0x00000010 */
#define FMC_SR2_ILEN                FMC_SR2_ILEN_Msk                           /*!<Interrupt Level detection Enable bit        */
#define FMC_SR2_IFEN_Pos            (5U)                                       
#define FMC_SR2_IFEN_Msk            (0x1U << FMC_SR2_IFEN_Pos)                 /*!< 0x00000020 */
#define FMC_SR2_IFEN                FMC_SR2_IFEN_Msk                           /*!<Interrupt Falling Edge detection Enable bit */
#define FMC_SR2_FEMPT_Pos           (6U)                                       
#define FMC_SR2_FEMPT_Msk           (0x1U << FMC_SR2_FEMPT_Pos)                /*!< 0x00000040 */
#define FMC_SR2_FEMPT               FMC_SR2_FEMPT_Msk                          /*!<FIFO empty                                  */

/*******************  Bit definition for FMC_SR3 register  *******************/
#define FMC_SR3_IRS_Pos             (0U)                                       
#define FMC_SR3_IRS_Msk             (0x1U << FMC_SR3_IRS_Pos)                  /*!< 0x00000001 */
#define FMC_SR3_IRS                 FMC_SR3_IRS_Msk                            /*!<Interrupt Rising Edge status                */
#define FMC_SR3_ILS_Pos             (1U)                                       
#define FMC_SR3_ILS_Msk             (0x1U << FMC_SR3_ILS_Pos)                  /*!< 0x00000002 */
#define FMC_SR3_ILS                 FMC_SR3_ILS_Msk                            /*!<Interrupt Level status                      */
#define FMC_SR3_IFS_Pos             (2U)                                       
#define FMC_SR3_IFS_Msk             (0x1U << FMC_SR3_IFS_Pos)                  /*!< 0x00000004 */
#define FMC_SR3_IFS                 FMC_SR3_IFS_Msk                            /*!<Interrupt Falling Edge status               */
#define FMC_SR3_IREN_Pos            (3U)                                       
#define FMC_SR3_IREN_Msk            (0x1U << FMC_SR3_IREN_Pos)                 /*!< 0x00000008 */
#define FMC_SR3_IREN                FMC_SR3_IREN_Msk                           /*!<Interrupt Rising Edge detection Enable bit  */
#define FMC_SR3_ILEN_Pos            (4U)                                       
#define FMC_SR3_ILEN_Msk            (0x1U << FMC_SR3_ILEN_Pos)                 /*!< 0x00000010 */
#define FMC_SR3_ILEN                FMC_SR3_ILEN_Msk                           /*!<Interrupt Level detection Enable bit        */
#define FMC_SR3_IFEN_Pos            (5U)                                       
#define FMC_SR3_IFEN_Msk            (0x1U << FMC_SR3_IFEN_Pos)                 /*!< 0x00000020 */
#define FMC_SR3_IFEN                FMC_SR3_IFEN_Msk                           /*!<Interrupt Falling Edge detection Enable bit */
#define FMC_SR3_FEMPT_Pos           (6U)                                       
#define FMC_SR3_FEMPT_Msk           (0x1U << FMC_SR3_FEMPT_Pos)                /*!< 0x00000040 */
#define FMC_SR3_FEMPT               FMC_SR3_FEMPT_Msk                          /*!<FIFO empty                                  */

