ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32F3xx/stm32f302xe.h
/*******************  Bit definition for FMC_SR4 register  *******************/
#define FMC_SR4_IRS_Pos             (0U)                                       
#define FMC_SR4_IRS_Msk             (0x1U << FMC_SR4_IRS_Pos)                  /*!< 0x00000001 */
#define FMC_SR4_IRS                 FMC_SR4_IRS_Msk                            /*!<Interrupt Rising Edge status                */
#define FMC_SR4_ILS_Pos             (1U)                                       
#define FMC_SR4_ILS_Msk             (0x1U << FMC_SR4_ILS_Pos)                  /*!< 0x00000002 */
#define FMC_SR4_ILS                 FMC_SR4_ILS_Msk                            /*!<Interrupt Level status                      */
#define FMC_SR4_IFS_Pos             (2U)                                       
#define FMC_SR4_IFS_Msk             (0x1U << FMC_SR4_IFS_Pos)                  /*!< 0x00000004 */
#define FMC_SR4_IFS                 FMC_SR4_IFS_Msk                            /*!<Interrupt Falling Edge status               */
#define FMC_SR4_IREN_Pos            (3U)                                       
#define FMC_SR4_IREN_Msk            (0x1U << FMC_SR4_IREN_Pos)                 /*!< 0x00000008 */
#define FMC_SR4_IREN                FMC_SR4_IREN_Msk                           /*!<Interrupt Rising Edge detection Enable bit  */
#define FMC_SR4_ILEN_Pos            (4U)                                       
#define FMC_SR4_ILEN_Msk            (0x1U << FMC_SR4_ILEN_Pos)                 /*!< 0x00000010 */
#define FMC_SR4_ILEN                FMC_SR4_ILEN_Msk                           /*!<Interrupt Level detection Enable bit        */
#define FMC_SR4_IFEN_Pos            (5U)                                       
#define FMC_SR4_IFEN_Msk            (0x1U << FMC_SR4_IFEN_Pos)                 /*!< 0x00000020 */
#define FMC_SR4_IFEN                FMC_SR4_IFEN_Msk                           /*!<Interrupt Falling Edge detection Enable bit */
#define FMC_SR4_FEMPT_Pos           (6U)                                       
#define FMC_SR4_FEMPT_Msk           (0x1U << FMC_SR4_FEMPT_Pos)                /*!< 0x00000040 */
#define FMC_SR4_FEMPT               FMC_SR4_FEMPT_Msk                          /*!<FIFO empty                                  */

/******************  Bit definition for FMC_PMEMx register  ******************/
#define FMC_PMEMx_MEMSETx_Pos       (0U)                                       
#define FMC_PMEMx_MEMSETx_Msk       (0xFFU << FMC_PMEMx_MEMSETx_Pos)           /*!< 0x000000FF */
#define FMC_PMEMx_MEMSETx           FMC_PMEMx_MEMSETx_Msk                      /*!<MEMSETx[7:0] bits (Common memory x setup time) */
#define FMC_PMEMx_MEMSETx_0         (0x01U << FMC_PMEMx_MEMSETx_Pos)           /*!< 0x00000001 */
#define FMC_PMEMx_MEMSETx_1         (0x02U << FMC_PMEMx_MEMSETx_Pos)           /*!< 0x00000002 */
#define FMC_PMEMx_MEMSETx_2         (0x04U << FMC_PMEMx_MEMSETx_Pos)           /*!< 0x00000004 */
#define FMC_PMEMx_MEMSETx_3         (0x08U << FMC_PMEMx_MEMSETx_Pos)           /*!< 0x00000008 */
#define FMC_PMEMx_MEMSETx_4         (0x10U << FMC_PMEMx_MEMSETx_Pos)           /*!< 0x00000010 */
#define FMC_PMEMx_MEMSETx_5         (0x20U << FMC_PMEMx_MEMSETx_Pos)           /*!< 0x00000020 */
#define FMC_PMEMx_MEMSETx_6         (0x40U << FMC_PMEMx_MEMSETx_Pos)           /*!< 0x00000040 */
#define FMC_PMEMx_MEMSETx_7         (0x80U << FMC_PMEMx_MEMSETx_Pos)           /*!< 0x00000080 */

#define FMC_PMEMx_MEMWAITx_Pos      (8U)                                       
#define FMC_PMEMx_MEMWAITx_Msk      (0xFFU << FMC_PMEMx_MEMWAITx_Pos)          /*!< 0x0000FF00 */
#define FMC_PMEMx_MEMWAITx          FMC_PMEMx_MEMWAITx_Msk                     /*!<MEMWAITx[7:0] bits (Common memory x wait time) */
#define FMC_PMEMx_MEMWAITx_0        (0x01U << FMC_PMEMx_MEMWAITx_Pos)          /*!< 0x00000100 */
#define FMC_PMEMx_MEMWAITx_1        (0x02U << FMC_PMEMx_MEMWAITx_Pos)          /*!< 0x00000200 */
#define FMC_PMEMx_MEMWAITx_2        (0x04U << FMC_PMEMx_MEMWAITx_Pos)          /*!< 0x00000400 */
#define FMC_PMEMx_MEMWAITx_3        (0x08U << FMC_PMEMx_MEMWAITx_Pos)          /*!< 0x00000800 */
#define FMC_PMEMx_MEMWAITx_4        (0x10U << FMC_PMEMx_MEMWAITx_Pos)          /*!< 0x00001000 */
#define FMC_PMEMx_MEMWAITx_5        (0x20U << FMC_PMEMx_MEMWAITx_Pos)          /*!< 0x00002000 */
#define FMC_PMEMx_MEMWAITx_6        (0x40U << FMC_PMEMx_MEMWAITx_Pos)          /*!< 0x00004000 */
#define FMC_PMEMx_MEMWAITx_7        (0x80U << FMC_PMEMx_MEMWAITx_Pos)          /*!< 0x00008000 */

#define FMC_PMEMx_MEMHOLDx_Pos      (16U)                                      
#define FMC_PMEMx_MEMHOLDx_Msk      (0xFFU << FMC_PMEMx_MEMHOLDx_Pos)          /*!< 0x00FF0000 */
#define FMC_PMEMx_MEMHOLDx          FMC_PMEMx_MEMHOLDx_Msk                     /*!<MEMHOLDx[7:0] bits (Common memory x hold time) */
#define FMC_PMEMx_MEMHOLDx_0        (0x01U << FMC_PMEMx_MEMHOLDx_Pos)          /*!< 0x00010000 */
#define FMC_PMEMx_MEMHOLDx_1        (0x02U << FMC_PMEMx_MEMHOLDx_Pos)          /*!< 0x00020000 */
#define FMC_PMEMx_MEMHOLDx_2        (0x04U << FMC_PMEMx_MEMHOLDx_Pos)          /*!< 0x00040000 */
#define FMC_PMEMx_MEMHOLDx_3        (0x08U << FMC_PMEMx_MEMHOLDx_Pos)          /*!< 0x00080000 */
#define FMC_PMEMx_MEMHOLDx_4        (0x10U << FMC_PMEMx_MEMHOLDx_Pos)          /*!< 0x00100000 */
#define FMC_PMEMx_MEMHOLDx_5        (0x20U << FMC_PMEMx_MEMHOLDx_Pos)          /*!< 0x00200000 */
#define FMC_PMEMx_MEMHOLDx_6        (0x40U << FMC_PMEMx_MEMHOLDx_Pos)          /*!< 0x00400000 */
#define FMC_PMEMx_MEMHOLDx_7        (0x80U << FMC_PMEMx_MEMHOLDx_Pos)          /*!< 0x00800000 */

#define FMC_PMEMx_MEMHIZx_Pos       (24U)                                      
#define FMC_PMEMx_MEMHIZx_Msk       (0xFFU << FMC_PMEMx_MEMHIZx_Pos)           /*!< 0xFF000000 */
#define FMC_PMEMx_MEMHIZx           FMC_PMEMx_MEMHIZx_Msk                      /*!<MEMHIZx[7:0] bits (Common memory x databus HiZ time) */
#define FMC_PMEMx_MEMHIZx_0         (0x01U << FMC_PMEMx_MEMHIZx_Pos)           /*!< 0x01000000 */
#define FMC_PMEMx_MEMHIZx_1         (0x02U << FMC_PMEMx_MEMHIZx_Pos)           /*!< 0x02000000 */
#define FMC_PMEMx_MEMHIZx_2         (0x04U << FMC_PMEMx_MEMHIZx_Pos)           /*!< 0x04000000 */
#define FMC_PMEMx_MEMHIZx_3         (0x08U << FMC_PMEMx_MEMHIZx_Pos)           /*!< 0x08000000 */
#define FMC_PMEMx_MEMHIZx_4         (0x10U << FMC_PMEMx_MEMHIZx_Pos)           /*!< 0x10000000 */
#define FMC_PMEMx_MEMHIZx_5         (0x20U << FMC_PMEMx_MEMHIZx_Pos)           /*!< 0x20000000 */
#define FMC_PMEMx_MEMHIZx_6         (0x40U << FMC_PMEMx_MEMHIZx_Pos)           /*!< 0x40000000 */
#define FMC_PMEMx_MEMHIZx_7         (0x80U << FMC_PMEMx_MEMHIZx_Pos)           /*!< 0x80000000 */

/******************  Bit definition for FMC_PMEM2 register  ******************/
#define FMC_PMEM2_MEMSET2_Pos       (0U)                                       
#define FMC_PMEM2_MEMSET2_Msk       (0xFFU << FMC_PMEM2_MEMSET2_Pos)           /*!< 0x000000FF */
#define FMC_PMEM2_MEMSET2           FMC_PMEM2_MEMSET2_Msk                      /*!<MEMSET2[7:0] bits (Common memory 2 setup time) */
#define FMC_PMEM2_MEMSET2_0         (0x01U << FMC_PMEM2_MEMSET2_Pos)           /*!< 0x00000001 */
#define FMC_PMEM2_MEMSET2_1         (0x02U << FMC_PMEM2_MEMSET2_Pos)           /*!< 0x00000002 */
#define FMC_PMEM2_MEMSET2_2         (0x04U << FMC_PMEM2_MEMSET2_Pos)           /*!< 0x00000004 */
#define FMC_PMEM2_MEMSET2_3         (0x08U << FMC_PMEM2_MEMSET2_Pos)           /*!< 0x00000008 */
#define FMC_PMEM2_MEMSET2_4         (0x10U << FMC_PMEM2_MEMSET2_Pos)           /*!< 0x00000010 */
#define FMC_PMEM2_MEMSET2_5         (0x20U << FMC_PMEM2_MEMSET2_Pos)           /*!< 0x00000020 */
#define FMC_PMEM2_MEMSET2_6         (0x40U << FMC_PMEM2_MEMSET2_Pos)           /*!< 0x00000040 */
#define FMC_PMEM2_MEMSET2_7         (0x80U << FMC_PMEM2_MEMSET2_Pos)           /*!< 0x00000080 */

#define FMC_PMEM2_MEMWAIT2_Pos      (8U)                                       
#define FMC_PMEM2_MEMWAIT2_Msk      (0xFFU << FMC_PMEM2_MEMWAIT2_Pos)          /*!< 0x0000FF00 */
#define FMC_PMEM2_MEMWAIT2          FMC_PMEM2_MEMWAIT2_Msk                     /*!<MEMWAIT2[7:0] bits (Common memory 2 wait time) */
#define FMC_PMEM2_MEMWAIT2_0        (0x01U << FMC_PMEM2_MEMWAIT2_Pos)          /*!< 0x00000100 */
#define FMC_PMEM2_MEMWAIT2_1        (0x02U << FMC_PMEM2_MEMWAIT2_Pos)          /*!< 0x00000200 */
#define FMC_PMEM2_MEMWAIT2_2        (0x04U << FMC_PMEM2_MEMWAIT2_Pos)          /*!< 0x00000400 */
#define FMC_PMEM2_MEMWAIT2_3        (0x08U << FMC_PMEM2_MEMWAIT2_Pos)          /*!< 0x00000800 */
#define FMC_PMEM2_MEMWAIT2_4        (0x10U << FMC_PMEM2_MEMWAIT2_Pos)          /*!< 0x00001000 */
#define FMC_PMEM2_MEMWAIT2_5        (0x20U << FMC_PMEM2_MEMWAIT2_Pos)          /*!< 0x00002000 */
#define FMC_PMEM2_MEMWAIT2_6        (0x40U << FMC_PMEM2_MEMWAIT2_Pos)          /*!< 0x00004000 */
#define FMC_PMEM2_MEMWAIT2_7        (0x80U << FMC_PMEM2_MEMWAIT2_Pos)          /*!< 0x00008000 */

#define FMC_PMEM2_MEMHOLD2_Pos      (16U)                                      
#define FMC_PMEM2_MEMHOLD2_Msk      (0xFFU << FMC_PMEM2_MEMHOLD2_Pos)          /*!< 0x00FF0000 */
#define FMC_PMEM2_MEMHOLD2          FMC_PMEM2_MEMHOLD2_Msk                     /*!<MEMHOLD2[7:0] bits (Common memory 2 hold time) */
#define FMC_PMEM2_MEMHOLD2_0        (0x01U << FMC_PMEM2_MEMHOLD2_Pos)          /*!< 0x00010000 */
#define FMC_PMEM2_MEMHOLD2_1        (0x02U << FMC_PMEM2_MEMHOLD2_Pos)          /*!< 0x00020000 */
#define FMC_PMEM2_MEMHOLD2_2        (0x04U << FMC_PMEM2_MEMHOLD2_Pos)          /*!< 0x00040000 */
#define FMC_PMEM2_MEMHOLD2_3        (0x08U << FMC_PMEM2_MEMHOLD2_Pos)          /*!< 0x00080000 */
#define FMC_PMEM2_MEMHOLD2_4        (0x10U << FMC_PMEM2_MEMHOLD2_Pos)          /*!< 0x00100000 */
#define FMC_PMEM2_MEMHOLD2_5        (0x20U << FMC_PMEM2_MEMHOLD2_Pos)          /*!< 0x00200000 */
#define FMC_PMEM2_MEMHOLD2_6        (0x40U << FMC_PMEM2_MEMHOLD2_Pos)          /*!< 0x00400000 */
#define FMC_PMEM2_MEMHOLD2_7        (0x80U << FMC_PMEM2_MEMHOLD2_Pos)          /*!< 0x00800000 */

#define FMC_PMEM2_MEMHIZ2_Pos       (24U)                                      
#define FMC_PMEM2_MEMHIZ2_Msk       (0xFFU << FMC_PMEM2_MEMHIZ2_Pos)           /*!< 0xFF000000 */
#define FMC_PMEM2_MEMHIZ2           FMC_PMEM2_MEMHIZ2_Msk                      /*!<MEMHIZ2[7:0] bits (Common memory 2 databus HiZ time) */
#define FMC_PMEM2_MEMHIZ2_0         (0x01U << FMC_PMEM2_MEMHIZ2_Pos)           /*!< 0x01000000 */
#define FMC_PMEM2_MEMHIZ2_1         (0x02U << FMC_PMEM2_MEMHIZ2_Pos)           /*!< 0x02000000 */
#define FMC_PMEM2_MEMHIZ2_2         (0x04U << FMC_PMEM2_MEMHIZ2_Pos)           /*!< 0x04000000 */
#define FMC_PMEM2_MEMHIZ2_3         (0x08U << FMC_PMEM2_MEMHIZ2_Pos)           /*!< 0x08000000 */
#define FMC_PMEM2_MEMHIZ2_4         (0x10U << FMC_PMEM2_MEMHIZ2_Pos)           /*!< 0x10000000 */
#define FMC_PMEM2_MEMHIZ2_5         (0x20U << FMC_PMEM2_MEMHIZ2_Pos)           /*!< 0x20000000 */
#define FMC_PMEM2_MEMHIZ2_6         (0x40U << FMC_PMEM2_MEMHIZ2_Pos)           /*!< 0x40000000 */
#define FMC_PMEM2_MEMHIZ2_7         (0x80U << FMC_PMEM2_MEMHIZ2_Pos)           /*!< 0x80000000 */

/******************  Bit definition for FMC_PMEM3 register  ******************/
#define FMC_PMEM3_MEMSET3_Pos       (0U)                                       
#define FMC_PMEM3_MEMSET3_Msk       (0xFFU << FMC_PMEM3_MEMSET3_Pos)           /*!< 0x000000FF */
#define FMC_PMEM3_MEMSET3           FMC_PMEM3_MEMSET3_Msk                      /*!<MEMSET3[7:0] bits (Common memory 3 setup time) */
#define FMC_PMEM3_MEMSET3_0         (0x01U << FMC_PMEM3_MEMSET3_Pos)           /*!< 0x00000001 */
#define FMC_PMEM3_MEMSET3_1         (0x02U << FMC_PMEM3_MEMSET3_Pos)           /*!< 0x00000002 */
#define FMC_PMEM3_MEMSET3_2         (0x04U << FMC_PMEM3_MEMSET3_Pos)           /*!< 0x00000004 */
#define FMC_PMEM3_MEMSET3_3         (0x08U << FMC_PMEM3_MEMSET3_Pos)           /*!< 0x00000008 */
#define FMC_PMEM3_MEMSET3_4         (0x10U << FMC_PMEM3_MEMSET3_Pos)           /*!< 0x00000010 */
#define FMC_PMEM3_MEMSET3_5         (0x20U << FMC_PMEM3_MEMSET3_Pos)           /*!< 0x00000020 */
#define FMC_PMEM3_MEMSET3_6         (0x40U << FMC_PMEM3_MEMSET3_Pos)           /*!< 0x00000040 */
#define FMC_PMEM3_MEMSET3_7         (0x80U << FMC_PMEM3_MEMSET3_Pos)           /*!< 0x00000080 */

#define FMC_PMEM3_MEMWAIT3_Pos      (8U)                                       
#define FMC_PMEM3_MEMWAIT3_Msk      (0xFFU << FMC_PMEM3_MEMWAIT3_Pos)          /*!< 0x0000FF00 */
#define FMC_PMEM3_MEMWAIT3          FMC_PMEM3_MEMWAIT3_Msk                     /*!<MEMWAIT3[7:0] bits (Common memory 3 wait time) */
#define FMC_PMEM3_MEMWAIT3_0        (0x01U << FMC_PMEM3_MEMWAIT3_Pos)          /*!< 0x00000100 */
#define FMC_PMEM3_MEMWAIT3_1        (0x02U << FMC_PMEM3_MEMWAIT3_Pos)          /*!< 0x00000200 */
#define FMC_PMEM3_MEMWAIT3_2        (0x04U << FMC_PMEM3_MEMWAIT3_Pos)          /*!< 0x00000400 */
#define FMC_PMEM3_MEMWAIT3_3        (0x08U << FMC_PMEM3_MEMWAIT3_Pos)          /*!< 0x00000800 */
#define FMC_PMEM3_MEMWAIT3_4        (0x10U << FMC_PMEM3_MEMWAIT3_Pos)          /*!< 0x00001000 */
#define FMC_PMEM3_MEMWAIT3_5        (0x20U << FMC_PMEM3_MEMWAIT3_Pos)          /*!< 0x00002000 */
#define FMC_PMEM3_MEMWAIT3_6        (0x40U << FMC_PMEM3_MEMWAIT3_Pos)          /*!< 0x00004000 */
#define FMC_PMEM3_MEMWAIT3_7        (0x80U << FMC_PMEM3_MEMWAIT3_Pos)          /*!< 0x00008000 */

